Рассмотрим таблицы результатов школьной олимпиады, которая проходит сразу в нескольких регионах в несколько дней:

регионы пронумерованы числами от 1 до 
r
r;
дни олимпиады пронумерованы числами от 1 до 
d
d;
задачи в 
i
i-м из дней пронумерованы числа от 1 до 
p
i
p 
i
​
 ;
все участники олимпиады в 
r
i
ri-м регионе пронумерованы числами от 1 до 
u
i
u 
i
​
  и имеют логин user_ri_id.
Общие результаты олимпиады представлены в файле "name_00_00.csv".

Постройте таблицы результатов по регионам и дням отдельно. Найдите регион и тур олимпиады, в котором у участника на 10-м месте больше всего баллов.

Отсортируйте результаты по убыванию суммы баллов, если несколько участников получили одинаковые суммы, то их стоит упорядочить по логину в лексикографическом порядке.

Формат ввода
Архив data-to-split.zip содержит данные для задачи:

в файлах с префиксом train находятся результаты олимпиады в требуемый день и итоговый файл;
в файле с префиксом test находятся результаты олимпиады, для которой нужно построить требуемый файл.

In [1]:
import pandas as pd

In [5]:
test0  = pd.read_csv('test_00_00.csv')
train0 = pd.read_csv('train_00_00.csv')
train1 = pd.read_csv('train_02_01.csv')

In [8]:
train0.head()

       username  1_1   1_2    2_1  2_2  score
0  user_03_0018   42  57.0  100.0  NaN    199
1  user_03_0004   88  42.0   65.0  NaN    195
2  user_03_0012   24  73.0   87.0  NaN    184
3  user_03_0020   91  78.0    NaN  NaN    169
4  user_03_0021   76  91.0    NaN  NaN    167

In [9]:
test0.head()

       username  1_1    1_2   1_3   1_4   2_1   2_2   2_3   2_4  score
0  user_03_0010    7   85.0  93.0   NaN  87.0  81.0  80.0  56.0    489
1  user_03_0001   91   94.0  66.0   NaN  75.0  72.0   NaN  72.0    470
2  user_04_0071   38  100.0  62.0  80.0  67.0  49.0  61.0   NaN    457
3  user_04_0039   96   93.0  40.0   NaN  40.0  90.0  95.0   NaN    454
4  user_01_0015   91   95.0  95.0   NaN  46.0  67.0  53.0   NaN    447

In [ ]:
train